In [2]:
import pandas as pd

In [3]:
people = {
    "fname": ["Corey", 'Alexey', 'Jim'], 
    "lname": ["Schafer", 'Prasolov', 'Beam'], 
    "email": ["CoreyMSchafer@gmail.com", 'salty91@email.com', 'singlemalt@email.com']
}

In [4]:
df = pd.DataFrame(people)

In [4]:
df.columns

Index(['fname', 'lname', 'email'], dtype='object')

In [15]:
df.columns = ['first_name', 'last_name', 'email']

In [5]:
df

    fname     lname                    email
0   Corey   Schafer  CoreyMSchafer@gmail.com
1  Alexey  Prasolov        salty91@email.com
2     Jim      Beam     singlemalt@email.com

In [10]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1     Alexey  Prasolov        salty91@email.com
2        Jim      Beam     singlemalt@email.com

In [13]:
df.columns = df.columns.str.replace('I', 'E')
df

  FERST_NAME LAST_NAME                    EMAEL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1     Alexey  Prasolov        salty91@email.com
2        Jim      Beam     singlemalt@email.com

In [16]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1     Alexey  Prasolov        salty91@email.com
2        Jim      Beam     singlemalt@email.com

In [18]:
df.loc[2] = ['Jim', 'Carrey', 'JimCarrey@mail.ru']

In [19]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1     Alexey  Prasolov        salty91@email.com
2        Jim    Carrey        JimCarrey@mail.ru

In [23]:
df.loc[2, ['last_name', 'email']] = ['Beam', 'singlemalt@email.com']
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1     Alexey  Prasolov        salty91@email.com
2        Jim      Beam     singlemalt@email.com

In [25]:
df.loc[2, 'last_name'] = 'Hurley'
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1     Alexey  Prasolov        salty91@email.com
2        Jim    Hurley     singlemalt@email.com

In [34]:
filt = (df['email'] == 'singlemalt@email.com')
df.loc[filt,'last_name'] = 'Warren'

In [38]:
df['email'] = df['email'].str.lower()

In [39]:
df

  first_name last_name                    email
0      Corey   Schafer  coreymschafer@gmail.com
1     Alexey  Prasolov        salty91@email.com
2        Jim    Warren     singlemalt@email.com

In [41]:
df['last_name'].apply(len)

0    7
1    8
2    6
Name: last_name, dtype: int64

In [48]:
def update_email(email):
    return email.lower()

In [49]:
df['email'].apply(update_email)

0    coreymschafer@gmail.com
1          salty91@email.com
2       singlemalt@email.com
Name: email, dtype: object

In [58]:
df['email']=df['email'].apply(update_email)

In [61]:
df

  first_name last_name  email
0      Corey   Schafer     23
1     Alexey  Prasolov     17
2        Jim    Warren     20

In [56]:
df['email']=df['email'].apply(lambda x: x.upper())

In [62]:
df['email']= ['coreymschafer@gmail.com', 'salty91@email.com', 'singlemalt@email.com']

In [63]:
df

  first_name last_name                    email
0      Corey   Schafer  coreymschafer@gmail.com
1     Alexey  Prasolov        salty91@email.com
2        Jim    Warren     singlemalt@email.com

In [64]:
df.apply(pd.Series.min)

first_name                     Alexey
last_name                    Prasolov
email         coreymschafer@gmail.com
dtype: object

In [68]:
df.apply(lambda x: x.min())

first_name                     Alexey
last_name                    Prasolov
email         coreymschafer@gmail.com
dtype: object

In [69]:
df.applymap(len)

   first_name  last_name  email
0           5          7     23
1           6          8     17
2           3          6     20

In [70]:
df.applymap(str.lower)

  first_name last_name                    email
0      corey   schafer  coreymschafer@gmail.com
1     alexey  prasolov        salty91@email.com
2        jim    warren     singlemalt@email.com

In [74]:
df['first_name'].replace({'Corey': 'Dan', 'Alexey': 'Mary'})

0     Dan
1    Mary
2     Jim
Name: first_name, dtype: object

In [7]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [ ]:
df.columns = ['first_name', 'last_name', 'email']

In [8]:
df['first_name'] + ' ' + df['last_name']

0      Corey Schafer
1    Alexey Prasolov
2           Jim Beam
dtype: object

In [10]:
df['full_name'] = df['first_name'] + ' ' + df['last_name']

In [33]:
df

                     email        full_name   first      last
0  CoreyMSchafer@gmail.com    Corey Schafer   Corey   Schafer
1        salty91@email.com  Alexey Prasolov  Alexey  Prasolov
2     singlemalt@email.com         Jim Beam     Jim      Beam

In [57]:
df.drop(columns=['fname', 'lname'], inplace=True)

In [20]:
df['full_name'].str.split(' ', expand=True)

        0         1
0   Corey   Schafer
1  Alexey  Prasolov
2     Jim      Beam

In [22]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [51]:
df = df.append({'first': 'Tony'}, ignore_index=True)

In [55]:
df.at[3,'email'] = 'proskater@email.com'

In [77]:
df

                     email   first   last
0  CoreyMSchafer@gmail.com     NaN    NaN
1        salty91@email.com     NaN    NaN
2     singlemalt@email.com     NaN    NaN
3      proskater@email.com    Tony   Hawk
5           Joker@mail.com  Arthur  Fleck

In [62]:
heroes = {
    'first': ['Peter', 'Arthur'], 
    'last': ['Parker', 'Fleck'], 
    'email': ['SpiderMan@mail.com', 'Joker@mail.com']
}
df2 = pd.DataFrame(heroes)

In [76]:
df.drop(index=4, inplace=True)

In [73]:
df2

    first    last               email
0   Peter  Parker  SpiderMan@mail.com
1  Arthur   Fleck      Joker@mail.com

In [70]:
df=df.append(df2, ignore_index=True, sort=False)

In [81]:
filt = df['email'] == 'salty91@email.com'
df.drop(index=df[filt].index)

                     email   first   last
0  CoreyMSchafer@gmail.com     NaN    NaN
2     singlemalt@email.com     NaN    NaN
3      proskater@email.com    Tony   Hawk
5           Joker@mail.com  Arthur  Fleck